app/controllers/imagems_controller.rb

  def index
    @imagems = Imagem.all
---
SELECT "imagems".* FROM "imagems"

  def upload
    if params.key?(:file_uploaded) == false
      redirect_to '/imagems/'
    end
    img = Imagem.new nome: params[:file_uploaded].original_filename, id_usuario: session[:usuario]["id"], tamanho: params[:file_uploaded].size/1024.0, publico: params.key?(:check_publico) ? params[:check_publico] : false, extensao: ".#{params[:file_uploaded].content_type.rpartition('/').last}", id_galeria: params[:galeria]
    img.galerias = params[:file_uploaded].tempfile

    img.galerias.original_filename = params[:file_uploaded].original_filename

    puts img.galerias.file.nil?

    img.save!
---
INSERT INTO "imagems" ("nome", "tamanho", "id_usuario", "created_at", "updated_at", "galerias") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "casamento1.jpg"], ["tamanho", 6.6767578125], ["id_usuario", 1], ["created_at", "2017-05-24 02:45:57.625539"], ["updated_at", "2017-05-24 02:45:57.625539"], ["galerias", "casamento1.jpg"]]

    def set_imagem
      @imagem = Imagem.find(params[:id])
---
SELECT  "imagems".* FROM "imagems" WHERE "imagems"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]