app/controllers/usuarios_controller.rb

INSERT INTO "usuarios" ("nome", "created_at", "updated_at") VALUES (?, ?, ?)  [["nome", "Guilherme"], ["created_at", "2017-05-24 00:30:51.728531"], ["updated_at", "2017-05-24 00:30:51.728531"]]
INSERT INTO "galeria" ("nome", "id_usuario", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nome", "Outros"], ["id_usuario", 6], ["created_at", "2017-05-24 04:58:19.252914"], ["updated_at", "2017-05-24 04:58:19.252914"]]
---
  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save

        galeria = Galerium.new nome: "Outros", id_usuario: @usuario.id
        galeria.save